In [9]:
import pandas as pd
import numpy as np

test_df = pd.read_csv("test.csv")

test_df['gender'] == 'Male'

0        True
1        True
2       False
3        True
4        True
        ...
2124    False
2125     True
2126    False
2127    False
2128     True
Name: major_discipline, Length: 2129, dtype: bool

In [10]:
test_df['major_discipline'] == 'STEM'

0        True
1        True
2       False
3        True
4        True
        ...
2124    False
2125     True
2126    False
2127    False
2128     True
Name: major_discipline, Length: 2129, dtype: bool

In [14]:
test_df[(test_df['gender'] == 'Male') & (test_df['major_discipline'] == 'STEM') & (test_df['education_level']=='Masters')].head(5)

    enrollee_id      city  ...  last_new_job training_hours
3         27385   city_13  ...             1             39
5           217   city_23  ...             2             12
16         7865   city_21  ...             1              4
26         9548  city_114  ...            >4             65
34        28610   city_16  ...            >4             18
39        12835  city_136  ...             1              9
40        20178   city_45  ...             1             20
45        29242   city_21  ...             1             49
47          113   city_16  ...             1             23
48        14685  city_114  ...             1             35

[10 rows x 13 columns]

In [16]:
test_df[test_df.gender.eq('Male')].head(5)

   enrollee_id      city  ...  last_new_job training_hours
0        32403   city_41  ...             1             21
2        31806   city_21  ...         never             15
3        27385   city_13  ...             1             39
4        27724  city_103  ...            >4             72
5          217   city_23  ...             2             12

[5 rows x 13 columns]

In [17]:
test_df[test_df.education_level=='High School'].head(5)

    enrollee_id      city  ...  last_new_job training_hours
2         31806   city_21  ...         never             15
49        20768   city_90  ...         never             87
55        16917  city_103  ...             1             48
60        19625   city_97  ...             1             31
73        16230  city_103  ...         never             84

[5 rows x 13 columns]

In [ ]:
test_df[test_df.education_level]